## Plan Result (braze-content-proxy-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/10606081266)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/BrazeContentProxy-Prod:254" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/BrazeContentProxy-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "app"
                  ~ secrets                = [
                        {
                            name      = "BRAZE_API_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:BrazeContentProxy/Prod/BRAZE_API_KEY:key::"
                        },
                      + {
                          + name      = "BRAZE_PRIVATE_KEY"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:BrazeContentProxy/Prod/BRAZE_PRIVATE_KEY:"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/BrazeContentProxy/Prod/SENTRY_DSN"
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "BrazeContentProxy-Prod" -> (known after apply)
      ~ revision                 = 254 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/BrazeContentProxy-Prod:254" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":705,"Program":"tfcmt","SHA1":"6f8dc06a5b92b214e2ea421981d6d203534850d4","Target":"braze-content-proxy-cdk-production","Vars":{},"WorkflowName":"Braze Content Proxy"} -->